%%%-------------------------------------------------------------------
%%% @author andrey-vl
%%% @copyright (C) 2015, < Triumph >
%%% @doc
%%%
%%% @end
%%% Created : 21. Сент. 2015 11:04
%%%-------------------------------------------------------------------
-module(pattern).
-author("andrey-vl").

%% API
-export([
    start/0,
    stop/0
]).

-define(APPS, []).

%% ===================================================================
%% API functions
%% ===================================================================

%%--------------------------------------------------------------------
%% @doc
%% Starts the application supervisor
%%
%% @end
%%--------------------------------------------------------------------
start() ->
    ok = ensure_started(?APPS),
    application:start(?MODULE).

%%--------------------------------------------------------------------
%% @doc
%% Stop the application supervisor
%%
%% @end
%%--------------------------------------------------------------------
stop() ->
    ok = stop_apps(lists:reverse(?APPS)).

%% ===================================================================
%% Internal functions
%% ===================================================================

%%--------------------------------------------------------------------
%% @doc
%% Запуск приложений
%%
%% @end
%%--------------------------------------------------------------------
ensure_started(Apps) -> ensure_started(Apps, ok).
ensure_started([], Acc) -> Acc;
ensure_started([App | Apps], Acc) ->
    case application:start(App) of
        ok -> ensure_started(Apps, Acc);
        {error, {already_started, App}} -> ensure_started(Apps, Acc);
        _ -> ensure_started(Apps, Acc)
    end.

%%--------------------------------------------------------------------
%% @doc
%% Убиваем аппликейшены
%%
%% @end
%%--------------------------------------------------------------------
stop_apps([]) -> ok;
stop_apps([App | Apps]) ->
    application:stop(App),
    stop_apps(Apps).
